<template>
  <v-container class="pt-5 mt-5" id="start" fluid>
    <v-row>
      <v-col class="col-xs-12 col-sm-10 offset-sm-1 col-md-8 offset-md-2 mt-5">
        <h1 class="mt-3 mb-5">Частно или групово обучение?</h1>
        <v-card class="px-6 py-6 card-text">
          Всяка година хиляди родители търсят уроци, за да помогнат на децата си да се справят с приемни изпити 
          и външно оценяване. Има обаче забележим дебат относно това дали груповото обучение или частното обучение, 
          е по-ефективно за детето. <br><br>

          За да изчистим това съмнение, трябва да разгледаме причините, които подтикват много родители да 
          решат да пратят детето си на уроци, както и основните разлики между груповото и частното обучение. <br><br>

          Защо родителите избират да пратят детето си на курсове? <br><br>
          <ul>
            <li>Гонят отлични резултати във и след училище</li>
            <li>Материала е сложен и изисква много време за подготовка</li>
            <li>Детето няма мотивация да учи</li>
            <li>Оценките на детето са се понижили</li>
          </ul><br>

          Трябва да обмислите различни фактори, когато решавате дали да пратите детето си на групово 
          обучение или на индивидуален учител. Нека разгледаме и двете опции отделно. <br><br>

          <v-divider />
          <h3 class="mt-5 mb-2">Групово обучение</h3><br>
          <div class="text-center"><img src="@/assets/images/bg.png" height="300px"/></div>
          <h4>Ползите от груповото обучение</h4>
          <ul>
            <li>Идеално за бързо обучаващите се.</li>
            <li>Учениците могат да обсъждат проблемите, да намерят решения и да работят заедно.</li>
            <li>Приятелската конкуренция повишава мотивацията на ученика.</li>
            <li>По-икономичен вариант. Частното обучение е повече от 2 пъти по-скъпо.</li>
          </ul>

          <h4>Недостатъци</h4>
          <ul>
            <li>Основният дефект на груповото обучение е по-претоварената среда. Когато много ученици учат заедно, фокусът 
          им върху урока може да намалее.</li>
            <li>Учениците, които научават материала по-бавно от останалите се нуждаят от допълнително внимание, което не може да бъде получено при групово обучение.</li>
          </ul><br>


          Групите в “Бг Ментор” се състоят от 3 до 6 деца, за да се обърне максимално внимание на всеки 
          ученик индивидуално. <br><br>

          <v-divider />
          <h3 class="mt-5 mb-2">Частно обучение</h3><br>
          <h4>Ползите от частното обучение</h4>
          <ul>
            <li>От съществено значение, когато искате детето ви да се занимава с изпуснат материал или да подобри разбирането на даден вид проблеми. 
          Идеална за деца, които се нуждаят от допълнително внимание и изостават в училище.</li>
            <li>Персонализираното внимани помага на учителя да идентифицира слабите точки на детето по-ефективно.</li>
            <li>В зависимост от способностите на вашето дете, преподавателят може да създаде уникален план за обучение, да използва концептуално картиране и да го следва през цялата учебна година.</li>
          </ul><br>

          <h4>Недостатъци на частното обучение</h4>
          <ul>
            <li>Единственият недостатък на частното обучение е липсата на социалния фактор и приятелската конкуренция. Понякога груповите проучвания се оказват полезни, тъй като повишават мотивацията и позволява на учениците да обсъждат сложни проблеми заедно и да намират решение.</li>
          </ul><br>

          <v-divider />
          <h3 class="mt-5 mb-2">Заключение</h3><br>
          Днешното поколение е свързано с конкуренцията; бизнеса се състезава за отлични идеи и признание, младежите се 
          борят за отлична работа, децата се състезават за по-високи резултати. Образованието е единственият начин, 
          който може да помогне на детето ви да оцелее в това състезание. По този начин, предоставяйки на 
          децата си най-доброто възможно образование, вие им осигурявате най-добрия старт в живота и правите 
          тази надпревара по-лесна. <br><br>

          Следователно, виждането на увеличаване на натовареността в училищата и груповото обучение, 
          назначаването на частен учител за вашето дете винаги ще бъде разумно решение. Успехът на вашата 
          решителност и упоритата работа на избран частен преподавател в крайна сметка ще си проличат в 
          резултатите на вашето дете. <br><br>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  data() {
    return {};
  }
}
</script>

<style scoped lang="sass">
h1, h3
  color: #6aaaff
</style>