<template>
  <section class="about">
    <h2 class="text-center">За нас</h2>
    <v-container>
      <v-row class="short-description">
        <v-col
          md="6"
          sm="8"
          xs="10"
          offset-md="3"
          offset-sm="2"
          offset-xs="1"
          class="about-us"
        >
          Ние сме екип от младежи, възпитаници на СМГ (Софийска Математическа
          Гимназия “Паисий Хилендарски”) и ФМИ (Факултет по Математика и
          Информатика). Това, че доскоро сме били на мястото на учениците ни
          дава изключително важни предимства - позволява ни да предразположим
          учениците и съответно да разберем кой материал ги затруднява.
          <br /><br /><br />
          Повечето деца изпитват проблеми именно с математиката, тъй като е
          предмет, който изисква постоянство и последователност. Щом изпуснеш
          част от материала, верижката е прекъсната и не можеш да продължиш
          напред. Това се явява пречка за усвояване на новия материал и децата
          се отказват от предмета, понеже няма кой да обърне внимание на частта,
          която им липсва. Ние намираме неясностите и знаем как да ги изчистим.
          След това математиката e лесна и забавна за всекиго, тъй като развива
          логическото ни мислене и ни помага да се справим с всеки проблем.
          <br /><br /><br />
        </v-col>
      </v-row>

      <v-row>
        <v-col
          md="3"
          sm="3"
          xs="12"
          v-for="teacher in teachers"
          :key="teacher.name"
        >
          <TeacherCard :teacher="teacher" />
        </v-col>
        <v-col
          md="3"
          sm="3"
          xs="12"
          v-for="founder in founders"
          :key="founder.name"
        >
          <TeacherCard :teacher="founder" />
        </v-col>
      </v-row>
    </v-container>
  </section>
</template>

<script>
import TeacherCard from "@/views/components/TeacherCard";
export default {
  components: {
    TeacherCard
  },
  data() {
    return {
      // TODO: replace these with store objects when ready
      teachers: [
        {
          name: "Светослав Василев",
          subjects: ["математика"],
          img_name: "Svetlio.jpg",
          cv_summary:
            "Следва Приложна математика в СУ. Бивш състезател по математика от СМГ.",
          bio: ""
        },
        {
          name: "Климентина Савова",
          subjects: ["математика"],
          img_name: "Kli.jpg",
          cv_summary:
            "Следва компютърни науки във ФМИ, завършила математическата гимназия в Пловдив.",
          bio:
            "В разширения национален отбор по физика за международното състезание International Young Physics Tournament."
        },
        {
          name: "Ема Евгениева",
          subjects: ["математика"],
          img_name: "Ema.png",
          cv_summary: "Следва компютърни науки във ФМИ",
          bio: ""
        },
        {
          name: "Димитър Кюртев",
          subjects: ["математика", "информатика / моделиране", ""],
          img_name: "Dimitar.jpg",
          cv_summary: "Следва компютърни науки във ФМИ, бивш възпитаник на СМГ",
          bio:
            "Математиката ми е страст от най-ранна възраст. Получих държавна стипендия и стаж по програмата Study IT fisrt, която се дава само на 10 първокурсници всяка година, с отличителен опит в програмирането. Още в гимназията водих школа по математика и затова съм уверен, че имам нужния опит да помогна и на вас."
        },
        {
          name: "Гери Чолакова",
          subjects: ["математика"],
          img_name: "",
          cv_summary: "",
          bio: ""
        }
      ],
      founders: [
        {
          name: "Теодор Илиев",
          subjects: ["математика"],
          img_name: "Teodor.png",
          cv_summary:
            "Следва компютърни науки във ФМИ. Завършил паралелката с най-висок бал в страната - СМГ с немски език",
          bio:
            "Занимавам се с преподаване на математика на ученици вече 3 години. Това, че съм завършил толкова скоро, ми дава възможността да гледам на проблемите по начин близък до този на учениците. Включвам се в тази инициатива, понеже ще ми даде възможност да помогна на възможно най-много хора."
        },
        {
          name: "Кристиян Цветанов",
          subjects: ["математика"],
          img_name: "Kris.jpg",
          cv_summary:
            "Завършил Компютърни науки и Мениждмънт в Университетът в Единбург (The University of Edinburgh) с отличие и медал за най-висок резултат в класа. Завършил СМГ (5-12 клас)",
          bio:
            "Занимавам се с програмиране професионално от 4 години. Това ми позволи да работя по достатъчно софтуерни проекти, които ни помагат да решим ежедневни проблеми по-ефикасно и по-качествено. Вярвам, че в това отношение, образованието е една от сферите, които заслужават, но все още не са получили достатъчно внимание."
        }
      ]
    };
  }
};
</script>

<style scoped lang="sass">
.about
  padding: 50px 0px
.about-us
  text-align: justify
.center-content
  justify-content: center
</style>
